<?php

namespace VeryBuy\Payment\ChinaTrust\VirtualAccount\Response;

trait ResponseFacilityTrait
{
    protected $facilities = [
        '0' => '臨櫃',
        '1' => '實體 ATM 交易',
        '2' => '語音交易',
        '3' => '未使用',
        '4' => '電子銀行',
        '5' => '外匯',
        '6' => '未使用',
        '7' => 'FEDI',
        '8' => '匯款',
        '9' => '信用卡',
        'A' => '未使用',
        'B' => '保留(現行郵局代收通路)',
        'C' => 'ACH',
        'D' => '實體 ATM 交易',
        'E' => '256x 整批轉即時',
        'F' => '226x 限同ID繳款',
        'G' => 'WebATM等非實體ATM交易',
        'H' => 'WebATM等非實體 ATM交易',
        'I' => 'Recycle ATM交易',
        'J' => '自行實體 ATM 繳費專區交易',
        'K' => '全家',
        'M' => '行動銀行轉帳繳費',
        'N' => '行動銀行繳費',
        'P' => '統一超商(學費系統專用)',
        'Q' => 'OK(學費系統專用)',
        'R' => '福客多(學費系統專用)',
        'S' => '全家(學費系統專用)',
        'T' => '萊爾富(學費系統專用)',
        'V' => '統一超商',
        'X' => '學校收款',
        'Y' => '學校收款(無金流)',
        'Z' => '到校收款',
    ];
}
